const baseReg = {
  socialCreditCodeReg: /^[A-Za-z0-9]{15,30}$/i , // 统一社会信用代码 手工输入，必选，默认为空 15至30位数字或字母或组合
  officialWebsiteReg: /^(http|ftp|https):\/\/[\w\-_]+(\.[\w\-_]+)+([\w\-\.,@?^=%&:/~\+#]*[\w\-\@?^=%&/~\+#])?$/i , // 企业官网  符合网址格式
  adminNameReg: /^([\u4e00-\u9fa5]|[a-zA-Z]){1,50}$/i , // 姓名、收票人 0-50位中英文字符取值范围，超出50位默认不显示，不可为空
  phoneNoReg: /^[1][0-9]{10}$/ , //手机号 0-11数字取值范围，超出数字无法显示，必须以1开头数字
  EmailReg: /^[a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/ , // 邮箱  普通格式
  qqReg: /^[1-9][0-9]{4,12}$/gim , // QQ号 纯数字5-11位
  cardIdReg:  /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/, // 证件号码 普通格式
  otherIdReg:  /^[a-zA-Z0-9_-]{1,50}$/, // 其他证件 限制长度为50  不能输入汉字
  cardNoReg: /^((E|K)\d{8}|(SE|DE|PE|MA|EE)\d{7})$/, // 护照号 必须输入符合要求的护照号码格式“E+8 位数字编号”,"SE+7 位数字编码","DE+7 位数字编码","PE+7 位数字编码","MA+7 位编号","K+8 位编号"
  commonReg: /^[\u4e00-\u9fa5]{1,30}$/i , // 公司级别、公司名称（100个字符）、企业简称    手工输入，必选，1-30长度取值范围 ，必须输入正确的公司名称，不可为空
  registeredCapitalReg: /^(?!0+(?:\.0+)?$)(?:[1-9]\d{0,8}|0)(?:\.\d{1,6})?$/, // 注册资金 只可输入数字，整数位0-9999999数字取值范围，小数位0-999999取值范围，超出范围默认不显示，不可为空
  institutionalBankReg: /^([\u4e00-\u9fa5]|[_`~!@#$%^&*()+=|{}':;',.<>/?~！@#￥%……&*（）——+|{}【】‘；：”“’。，、？]*){1,100}$/i , // 开户行 1-100长度取值范围 ，必须输入正确的开户行名称，不可为空
  accountPermitPathReg: /^J[0-9]{13}$/ , // 开户许可证 J开头+13位数字
  smsReg: /^\d{6}$/ , // 短信验证码 系统发送随机六位正整数验证码
  passwordReg: /^(?!^(\d+|[a-zA-Z]+|[_`~!@#$%^&*()+=|{}':;',.<>/?~！@#￥%……&*（）——+|{}【】‘；：”“’。，、？]+)$)^[\w_`~!@#$%^&*()+=|{}':;',.<>/?~！@#￥%……&*（）——+|{}【】‘；：”“’。，、？]{8,32}$/ , // 密码 任意字符3-32位
  BillingReg: /^([\u4e00-\u9fa5]|[a-zA-Z]){1,30}$/i , // 角色名称30字前后除空格
  taxpayerReg: /^[a-zA-Z0-9_-]{15,30}$/ , // 纳税人识别号 15至30位数字或字母_-组合
  projectReg: /^[A-Z0-9_-]{1,50}$/ , // 立项项目编号 最大50位数字与大写字母_-组合
  companyBaseAccountReg: /^\d{1,30}$/ , // 银行基本账号 15-30位纯数字组合
  addressReg: /^([\u4e00-\u9fa5]|[a-zA-Z0-9_-]){1,150}$/i  // 详细地址 0-150位汉字、数字、字母_-取值范围
};

export default baseReg;
